ams/src/Catalogs/ДатаМобайл_Пользователи/ДатаМобайл_Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДатаМобайл_Пользователи</name>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/ДатаМобайл_Пользователи/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	Если Ссылка.Пустая() Тогда
		ПроверитьНаДубльПоПользователю(Отказ);	   
	КонецЕсли; 
	
	Если Не ПустаяСтрока(Логин) Тогда
		ПроверитьНаУникальностьШтрихкод(Логин, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
	 	Возврат;
	КонецЕсли;
	
	// Отключение механизма регистрации объектов.
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	Если Не Этотобъект.ДополнительныеСвойства.Свойство("НеВыполнятьКонтрольУдаляемых") Тогда
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Непосредственное удаление запрещено, могут остаться битые ссылки!");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДубльПоПользователю(Отказ)
	
	Если Не Справочники.ДатаМобайл_Пользователи.НайтиПоРеквизиту("Пользователь1С", ЭтотОбъект.Пользователь1С).Пустая() Тогда
		Отказ = Истина;
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Данный пользователь был добавлен.");
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьНаУникальностьШтрихкод(Логин, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаМобайл_Пользователи.Ссылка КАК Пользователь,
	|	ДатаМобайл_Пользователи.Логин КАК Штрихкод,
	|	ДатаМобайл_Пользователи.Пользователь1С.Наименование КАК ПользовательПредставление
	|ИЗ
	|	Справочник.ДатаМобайл_Пользователи КАК ДатаМобайл_Пользователи
	|ГДЕ
	|	ДатаМобайл_Пользователи.Логин = &Штрихкод
	|";
	
	СтрокаШтрихкода = СокрП(Логин);
	Запрос.УстановитьПараметр("Штрихкод", СтрокаШтрихкода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Ссылка <> Выборка.Пользователь Тогда
			ОписаниеОшибки = НСтр("ru='Такой штрихкод уже назначен для пользователя %Пользователь%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Пользователь%", Выборка.ПользовательПредставление);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки;
			Сообщение.Поле = "Запись.Штрихкод";
			Сообщение.Сообщить();
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
